
void cabecalho(void)
{
    gotoxy(1,1);
    printf("\n ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                               BIBLIOTECA A.S.T.R.A.F                                               ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
}

void rodape(void)
{
    gotoxy(1,41);
    printf("\n ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                               ASTRA WINTER TECNOLOGIA                                              ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
}

void retangulo(void)
{
    gotoxy(1,6);
    printf("\n ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
}

void mostralivro(void)
{
    gotoxy(1,7);
    printf(" ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                           ~~~~~:D8                                                                 ³\n");
    printf(" ³                                     ~~~~~~~~~~~~::D                 ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿   ³\n");
    printf(" ³                                  ::~~~~~~~~~~~~~~::D                ³                                          ³   ³\n");
    printf(" ³                                ::::::::~~~~~~~~~~~::D               ³                                          ³   ³\n");
    printf(" ³                               :::::::::::~~~~~~~~~:::D              ³                                          ³   ³\n");
    printf(" ³                             ~::::::::::::::~~~~~~~~:::D             ³                                          ³   ³\n");
    printf(" ³                    ,::::::~~~:::,,,,,,:::::::~~~~~:::::D            ³                                          ³   ³\n");
    printf(" ³                 ,,,,:::::::~+~:,,....,,,::::::~~::::::::D           ³                                          ³   ³\n");
    printf(" ³              ,,,,,,,,,::::::~~:,,......,,,::::::~~:::::::D          ³                                          ³   ³\n");
    printf(" ³            ,,,,,,,,,,,,,:::::=~,,.......,,,::::::~~:::::,,D         ³                                          ³   ³\n");
    printf(" ³          ,,,,,,,,,,,,,,,,::::~=:,,.......,,,::::::~~~::::,,D        ³                                          ³   ³\n");
    printf(" ³       =,,,,,,,,,,,,,,,,,,,::::~=:,,.......,,,:::::::~~::::,.D       ³                                          ³   ³\n");
    printf(" ³       ?=,,,,,,,,,,,,,,,,,,:::::~=,,,........,,:::::::~~:::::,D      ³                                          ³   ³\n");
    printf(" ³      8O~=,,,,,,,,,,,,,,,,,::::::~=,,,........,,::::::::~~::::ID     ³                                          ³   ³\n");
    printf(" ³      8OO~,,,,,,,,,,,,,,,,,:::::::~=,,,........,,,::::::::::,7O$N    ³                                          ³   ³\n");
    printf(" ³       8O?=,,,,,...,,,,,,,,::::::::~:,,,.........,,,.?77Z$O7NDO      ³                                          ³   ³\n");
    printf(" ³        DO++,,,,......,,,,,,::::::,:~:,,,....  ?IZ$$$$$$NDD          ³                                          ³   ³\n");
    printf(" ³        DOO~~,,,,......,,,,,,::::::,:~:,,,..?O$$$O$$$DO              ³                                          ³   ³\n");
    printf(" ³         8OO~,,,,.......,,,,,,::::::,:~:,,.8$$$$$ZDD                 ³                                          ³   ³\n");
    printf(" ³          DO7=,,,........,,,,,,::::::,:~:,$Z$$$N8                    ³                                          ³   ³\n");
    printf(" ³          DDO==,,,........,,,,,,::????I:~$$$$D                       ³                                          ³   ³\n");
    printf(" ³           8OO=,,,.........,..???$$$ZZ$$NNMN                         ³                                          ³   ³\n");
    printf(" ³            DO7=,,,.........??$$$$$$$$$$MD8                          ³                                          ³   ³\n");
    printf(" ³            DDO?+,,.......I$ZO$$8$$NN   N                            ³                                          ³   ³\n");
    printf(" ³             DOO+,,.....7Z$$$$$DO                                    ³                                          ³   ³\n");
    printf(" ³              DOO+,....$$$$$NO                                       ³                                          ³   ³\n");
    printf(" ³              NDO7+..$$$$ND                                          ³                                          ³   ³\n");
    printf(" ³               DOO=$$$NDM                                            ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ   ³\n");
    printf(" ³                DO$$NO                                                                                              ³\n");
    printf(" ³                NNDN                                                                                                ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ³                                                                                                                    ³\n");
    printf(" ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
}

void mostradados(void)
{
    gotoxy(1,7);
    printf("             ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("             ³                                   CADASTRO DE NOVO LIVRO                                   ³\n");
    printf("             ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
    printf("             ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Titulo:                                                                                  ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Autor:                                                                                   ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Genero:                                                                                  ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Editora:                                                                                 ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Edicao:                                                                                  ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Ano:                                                                                     ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Paginas:                                                                                 ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   ISBN:                                                                                    ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ³   Localizacao:                                                                             ³\n");
    printf("             ³                                                                                            ³\n");
    printf("             ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
    gotoxy(25,15);
}

void mostradados2(void)
{
    gotoxy(1,7);
    printf("            ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("            ³                                   INFORMACOES SOBRE LIVRO                                    ³\n");
    printf("            ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
    printf("            ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Titulo:                                                                                    ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Autor:                                                                                     ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Genero:                                                                                    ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Editora:                                                                                   ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Edicao:                                                                                    ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Ano:                                                                                       ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Paginas:                                                                                   ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   ISBN:                                                                                      ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ³   Localizacao:                                                                               ³\n");
    printf("            ³                                                                                              ³\n");
    printf("            ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
    gotoxy(25,15);
}

void listalivro(void)
{
    printf("            ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("            ³                                                                                            ³\n");
    printf("            ³                                                                                            ³\n");
    printf("            ³                                                                                            ³\n");
    printf("            ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
}

void mostrabotoes(void)
{
    gotoxy(1,39);
    printf("            ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿\n");
    printf("            ³     - MUDAR STATUS    ³     - ALTERAR LIVRO   ³     - EXCLUIR LIVRO   ³         - SAIR       ³\n");
    printf("            ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ\n");
    gotoxy(16,40);
    textcolor(LIGHTRED);
    printf("F1");
    gotoxy(40,40);
    printf("F2");
    gotoxy(64,40);
    printf("F3");
    gotoxy(91,40);
    printf("ESC");
    textcolor(WHITE);
}
